tutorials/org/topoigit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Computational Humanities and History of Science</title>
<!-- 2016-08-25 Do 16:30 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Malte Vogl" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Computational Humanities and History of Science</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. Required software</a></li>
<li><a href="#sec-1-2">1.2. Getting started with Git</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Branches</a></li>
<li><a href="#sec-1-2-2">1.2.2. Github account</a></li>
<li><a href="#sec-1-2-3">1.2.3. Setting up Git</a></li>
<li><a href="#sec-1-2-4">1.2.4. Add repository</a></li>
<li><a href="#sec-1-2-5">1.2.5. Getting the data</a></li>
<li><a href="#sec-1-2-6">1.2.6. Contributing to the repository</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Git work flow</a></li>
<li><a href="#sec-3">3. Jupyter notebook</a>
<ul>
<li><a href="#sec-3-1">3.1. Adding Python 3 kernel</a></li>
<li><a href="#sec-3-2">3.2. Links to examples or learning resources</a></li>
<li><a href="#sec-3-3">3.3. Reacquired and useful extensions</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. nbstripout</a></li>
<li><a href="#sec-3-3-2">3.3.2. Jupyter extensions</a></li>
<li><a href="#sec-3-3-3">3.3.3. Jupyter Nbextensions Configurator</a></li>
<li><a href="#sec-3-3-4">3.3.4. jupyter_cms</a></li>
<li><a href="#sec-3-3-5">3.3.5. ipywidgets</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Python-Packages</a></li>
<li><a href="#sec-3-5">3.5. Usage</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Import Notebook file</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Helper functions</a>
<ul>
<li><a href="#sec-4-1">4.1. Medieval Diagrams</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Presentation</a></li>
<li><a href="#sec-4-1-2">4.1.2. Dataframe Preparation</a></li>
<li><a href="#sec-4-1-3">4.1.3. Modification</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Tasks</a>
<ul>
<li><a href="#sec-5-1">5.1. <span class="todo TODO">TODO</span> Add python visualization examples</a></li>
<li><a href="#sec-5-2">5.2. <span class="todo TODO">TODO</span> Extend Jupyter usage</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes the work flow for contributing to the <a href="http://github.com/computational-humanities/topoi">Computational Humanities</a> 
project on Github. Essential tools are introduced and available helper functions explained. 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Required software</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To be able to collaborate, several software packages are necessary. Depending on
the operating system, installation procedures can be different. Therefore, only package names 
are mentioned not the actual installation process. 
</p>

<dl class="org-dl">
<dt> Git </dt><dd>The basic git software for terminal operations. Additionally, several GUI programs exist for all platforms.
</dd>
<dt> Python </dt><dd>Python is the programming language used in the Jupyter notebooks. A newer version, like 3.4, would be best, but older versions &gt;2.7 should also work (apart from the usual errors, e.g. in print commands)
</dd>
<dt> Jupyter </dt><dd><a href="http://jupyter.org/">Jupyter</a> is a project, which aims at making science more collaborative and open. Several programming languages can be run inside a browser window, making programs more accessible. Installation instructions can be found <a href="http://jupyter.readthedocs.io/en/latest/install.html">here</a>.
</dd>
</dl>
</div>
</div>



<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Getting started with Git</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This section introduces the usage of the version control system Git and
 explains how to access the public data on Github.
</p>

<p>
The URL of the project is : <a href="https://github.com/computational-humanities/">https://github.com/computational-humanities/</a>
The current active project folder is:   topoi
</p>

<p>
DOCS via Sphinx are available at  <a href="https://computational-humanities.github.io/topoi/index.html">https://computational-humanities.github.io/topoi/index.html</a>
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Branches</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
There are several active branches in the project. The basic idea is, that every contributor is 
working in its own branch marked by 'dev_', e.g. 'dev_ot', such that a stable version is always 
available in the master branch. 
</p>

<p>
Changes from the development branches are merged regularly into the master branch by issuing a 
pull request from the Github website interface. 
</p>

<p>
master # protected, should not be overwritten from another branch by force
</p>

<p>
gh-pages (for sphinx docs)
</p>

<p>
dev_NAME (for every collaborator one branch, e.g. dev_gordon, dev_ma)
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Github account</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Every collaborator needs a github account: <a href="https://github.com/join?source=header-home">https://github.com/join?source=header-home</a>
</p>

<p>
Once the user name is know, send mail with user name to malte.vogl@hu-berlin.de.
</p>

<p>
An invitation will be send to the email address you provided while signing in on github. 
Accept the invitation by following the link. Then continue below&#x2026;
</p>
</div>
</div>


<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Setting up Git</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
This explains setting up git on a Ubuntu machine in terminal mode. There is a large choice of GUI 
programs for Git for Mac and Win machines available. 
</p>

<p>
First, create a working folder for the Computational Humanities project. Change into that folder.
Run (every line seperately)
</p>
<div class="org-src-container">

<pre class="src src-bash">git init
git config --global user.name "Your user name"
git config --gloabl user.email useremail@address.com
</pre>
</div>

<p>
To save the user name and password for a prescribed amount of time use these two (timeout in seconds): 
</p>
<div class="org-src-container">

<pre class="src src-bash">git config --global credential.helper cache
git config --global credential.helper 'cache --timeout=3600'
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Add repository</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
The following line adds a link to the public topoi git, that can be accessed by the shortcut origin
</p>
<div class="org-src-container">

<pre class="src src-bash">git remote add origin https://github.com/computational-humanities/topoi.git
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Getting the data</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
To retrieve the current set of data from public git
</p>
<div class="org-src-container">

<pre class="src src-bash">git pull origin master
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> Contributing to the repository</h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
The basic idea is as explained above. We create a working branch for every collaborator, by using
</p>
<div class="org-src-container">

<pre class="src src-bash">git checkout -b name_of_branch
</pre>
</div>

<p>
To see whether the change of branch has worked out run
</p>
<div class="org-src-container">

<pre class="src src-bash">git branch
</pre>
</div>

<p>
This should show the newly named branch in green, together with other branches, like master.
To make this new branch known to everyone, it has to be pushed to the online repository
</p>
<div class="org-src-container">

<pre class="src src-bash">git push origin name_of_branch
</pre>
</div>

<p>
The last step will only work if the user is registered as a collaborator of the topoi project. 
Git will ask for user name and password. These are the ones used for signing in the user
to Github, who has registered as a collaborator. 
</p>
</div>
</div>
</div>
</div>
