tutorials/org/topoigit.org
* Git work flow

After changing to the working folder, first check if you are in the correct branch
#+BEGIN_SRC bash
 git branch
#+END_SRC

If that is not the case, change to it by
#+BEGIN_SRC bash
    git checkout name_of_branch
#+END_SRC

There might be errors due to unsaved changes of files in the master branch.

On the development branch, you ca work as usual, e.g. add a test file to a new folder. 

Running 
#+BEGIN_SRC bash 
  git status
#+END_SRC

should show the changed, deleted, or new file colored in red. This indicates, that the file is not 
yet in the staging area, an intermediate state of files to be send to the online version of the branch.

To make the changes part of this staging area, use
#+BEGIN_SRC bash
 git add filename1 filename2 ...
#+END_SRC
to add all changes that should be published. 

To bring the changes to the online version of the branch use first
#+BEGIN_SRC bash
 git commit -m 'useful commit message describing the changes'
#+END_SRC

The changes are now logged for being ready to move to the online repository. However, they are
not yet there! 

You could continue working, adding changes to bundle a new commit. To finally send them online, run
#+BEGIN_SRC bash
    git push origin name_of_branch
#+END_SRC
This will send the bundled changes, called commits, to the online version of your working branch.


* Jupyter notebook

This section describes how to work with the Jupyter notebook. 

** Adding Python 3 kernel

Depending on the python-pip version used while installing jupyter, it happens that only a Python 2 kernel is available after starting the notebook server. 
This can be changed by running the following commands
#+BEGIN_SRC
 sudo apt-get install python3 && python3-pip
 pip3 install jupyter
 ipython3 kernelspec install-self
#+END_SRC
on a Ubuntu system. 

For Anaconda users, the following might be an option
#+BEGIN_SRC 
conda create -n py3k python=3 anaconda
source activate py3k
ipython kernelspec install-self
#+END_SRC
This first creates a virtual environment based on Python 3, named py3k. After activating this environment, ipython corresponds to the Python 3 version and installs the correct kernel.

** Links to examples or learning resources

+ Gallery for Jupyter notebooks :: https://github.com/ipython/ipython/wiki/A-gallery-of-interesting-IPython-Notebooks
+ Some tricks with Jupyter :: https://blog.dominodatalab.com/lesser-known-ways-of-using-notebooks/
+ and more from same source :: https://blog.dominodatalab.com/interactive-dashboards-in-jupyter/
+ Publication ready notebooks :: http://blog.juliusschulz.de/blog/ultimate-ipython-notebook
+ JupyterHUB :: https://github.com/jupyterhub/jupyterhub
+ Jupyter Dashboard :: https://github.com/jupyter-incubator/dashboards


** Reacquired and useful extensions
   
*** nbstripout

Since we are using Github for version control, at least this extension for Jupyter notebooks is mandatory.
The [[https://pypi.python.org/pypi/nbstripout/0.2.7][python package]] acts as a filter before pulling or pushing to the Github repository. 

Installing systemwide using 
#+BEGIN_SRC bash
 pip install nbstripout
#+END_SRC

and setting-up with
#+BEGIN_SRC bash
 nbstripout --install
#+END_SRC

It strips all output and information on the execution of cells from the notebook. This allows to compare the content of the actual code cells. without this package, Github treats Jupyter notebooks as binary, and automatic merges are not possible. 

*** Jupyter extensions 

Jupyter extensions are useful helper functions, developed by third party. To get an overview, go to [[https://github.com/ipython-contrib/jupyter_contrib_nbextensions][this site]].
To install all extensions, simply use
#+BEGIN_SRC python
pip install https://github.com/ipython-contrib/jupyter_contrib_nbextensions/tarball/master
jupyter contrib nbextension install --user
#+END_SRC
which first downloads the latest version from Github and installs it via pip and then makes the extensions available to Jupyter.

*** Jupyter Nbextensions Configurator

All extensions for Jupyter can be controlled with the Jupyter Nbextensions Configurator, [[https://github.com/Jupyter-contrib/jupyter_nbextensions_configurator][link]]. 

Installation and setup via
#+BEGIN_SRC bash
pip install jupyter_nbextensions_configurator
jupyter nbextensions_configurator enable --user
#+END_SRC

Once a notebook server is started, visit ~http://localhost:8888/nbextensions~ to see all available extensions. Click on any to configure. 

*** jupyter_cms

This [[https://github.com/jupyter-incubator/contentmanagement][extension]] for Jupyter notebooks allows to import full notebooks as if they were modules. 

For Jupyter versions greater 4.2 (check by ~jupyter notebook --version~) installation is simply 
#+BEGIN_SRC bash
 pip install jupyter_cms
 jupyter cms quick-setup --sys-prefix
#+END_SRC
and restart notebook server.

For other Jupyter version, check the above link for instructions. 

*** ipywidgets

The interactive HTML widgets allow to create interactive notebooks with sliders, dropdown menues or check-boxes
Installation is via
#+BEGIN_SRC bash
pip install ipywidgets
jupyter nbextension enable --py --sys-prefix widgetsnbextension
#+END_SRC
possibly requiering a restart. 

Examples include
+ ipyleaflet :: a leaflet widget for interactive maps, [[https://github.com/ellisonbg/ipyleaflet][link]] 
+ bqplot :: for interactive plotting, [[https://github.com/bloomberg/bqplot][link]]
+ nature demo :: running interactive plot on private Jupyter server, [[http://www.nature.com/news/ipython-interactive-demo-7.21492][link]]


