tutorials/org/topoigit.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Git work flow</h2>
<div class="outline-text-2" id="text-2">
<p>
After changing to the working folder, first check if you are in the correct branch
</p>
<div class="org-src-container">

<pre class="src src-bash">git branch
</pre>
</div>

<p>
If that is not the case, change to it by
</p>
<div class="org-src-container">

<pre class="src src-bash">git checkout name_of_branch
</pre>
</div>

<p>
There might be errors due to unsaved changes of files in the master branch.
</p>

<p>
On the development branch, you ca work as usual, e.g. add a test file to a new folder. 
</p>

<p>
Running 
</p>
<div class="org-src-container">

<pre class="src src-bash">git status
</pre>
</div>

<p>
should show the changed, deleted, or new file colored in red. This indicates, that the file is not 
yet in the staging area, an intermediate state of files to be send to the online version of the branch.
</p>

<p>
To make the changes part of this staging area, use
</p>
<div class="org-src-container">

<pre class="src src-bash">git add filename1 filename2 ...
</pre>
</div>
<p>
to add all changes that should be published. 
</p>

<p>
To bring the changes to the online version of the branch use first
</p>
<div class="org-src-container">

<pre class="src src-bash">git commit -m 'useful commit message describing the changes'
</pre>
</div>

<p>
The changes are now logged for being ready to move to the online repository. However, they are
not yet there! 
</p>

<p>
You could continue working, adding changes to bundle a new commit. To finally send them online, run
</p>
<div class="org-src-container">

<pre class="src src-bash">git push origin name_of_branch
</pre>
</div>
<p>
This will send the bundled changes, called commits, to the online version of your working branch.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Jupyter notebook</h2>
<div class="outline-text-2" id="text-3">
<p>
This section describes how to work with the Jupyter notebook. 
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Adding Python 3 kernel</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Depending on the python-pip version used while installing jupyter, it happens that only a Python 2 kernel is available after starting the notebook server. 
This can be changed by running the following commands
</p>
<pre class="example">
sudo apt-get install python3 &amp;&amp; python3-pip
pip3 install jupyter
ipython3 kernelspec install-self
</pre>
<p>
on a Ubuntu system. 
</p>

<p>
For Anaconda users, the following might be an option
</p>
<pre class="example">
conda create -n py3k python=3 anaconda
source activate py3k
ipython kernelspec install-self
</pre>
<p>
This first creates a virtual environment based on Python 3, named py3k. After activating this environment, ipython corresponds to the Python 3 version and installs the correct kernel.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Links to examples or learning resources</h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt> Gallery for Jupyter notebooks </dt><dd><a href="https://github.com/ipython/ipython/wiki/A-gallery-of-interesting-IPython-Notebooks">https://github.com/ipython/ipython/wiki/A-gallery-of-interesting-IPython-Notebooks</a>
</dd>
<dt> Some tricks with Jupyter </dt><dd><a href="https://blog.dominodatalab.com/lesser-known-ways-of-using-notebooks/">https://blog.dominodatalab.com/lesser-known-ways-of-using-notebooks/</a>
</dd>
<dt> and more from same source </dt><dd><a href="https://blog.dominodatalab.com/interactive-dashboards-in-jupyter/">https://blog.dominodatalab.com/interactive-dashboards-in-jupyter/</a>
</dd>
<dt> Publication ready notebooks </dt><dd><a href="http://blog.juliusschulz.de/blog/ultimate-ipython-notebook">http://blog.juliusschulz.de/blog/ultimate-ipython-notebook</a>
</dd>
<dt> JupyterHUB </dt><dd><a href="https://github.com/jupyterhub/jupyterhub">https://github.com/jupyterhub/jupyterhub</a>
</dd>
<dt> Jupyter Dashboard </dt><dd><a href="https://github.com/jupyter-incubator/dashboards">https://github.com/jupyter-incubator/dashboards</a>
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Reacquired and useful extensions</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> nbstripout</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Since we are using Github for version control, at least this extension for Jupyter notebooks is mandatory.
The <a href="https://pypi.python.org/pypi/nbstripout/0.2.7">python package</a> acts as a filter before pulling or pushing to the Github repository. 
</p>

<p>
Installing systemwide using 
</p>
<div class="org-src-container">

<pre class="src src-bash">pip install nbstripout
</pre>
</div>

<p>
and setting-up with
</p>
<div class="org-src-container">

<pre class="src src-bash">nbstripout --install
</pre>
</div>

<p>
It strips all output and information on the execution of cells from the notebook. This allows to compare the content of the actual code cells. without this package, Github treats Jupyter notebooks as binary, and automatic merges are not possible. 
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Jupyter extensions</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Jupyter extensions are useful helper functions, developed by third party. To get an overview, go to <a href="https://github.com/ipython-contrib/jupyter_contrib_nbextensions">this site</a>.
To install all extensions, simply use
</p>
<div class="org-src-container">

<pre class="src src-python">pip install https://github.com/ipython-contrib/jupyter_contrib_nbextensions/tarball/master
jupyter contrib nbextension install --user
</pre>
</div>
<p>
which first downloads the latest version from Github and installs it via pip and then makes the extensions available to Jupyter.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Jupyter Nbextensions Configurator</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
All extensions for Jupyter can be controlled with the Jupyter Nbextensions Configurator, <a href="https://github.com/Jupyter-contrib/jupyter_nbextensions_configurator">link</a>. 
</p>

<p>
Installation and setup via
</p>
<div class="org-src-container">

<pre class="src src-bash">pip install jupyter_nbextensions_configurator
jupyter nbextensions_configurator enable --user
</pre>
</div>

<p>
Once a notebook server is started, visit <code>http://localhost:8888/nbextensions</code> to see all available extensions. Click on any to configure. 
</p>
</div>
</div>

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> jupyter_cms</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
This <a href="https://github.com/jupyter-incubator/contentmanagement">extension</a> for Jupyter notebooks allows to import full notebooks as if they were modules. 
</p>

<p>
For Jupyter versions greater 4.2 (check by <code>jupyter notebook --version</code>) installation is simply 
</p>
<div class="org-src-container">

<pre class="src src-bash">pip install jupyter_cms
jupyter cms quick-setup --sys-prefix
</pre>
</div>
<p>
and restart notebook server.
</p>

<p>
For other Jupyter version, check the above link for instructions. 
</p>
</div>
</div>

<div id="outline-container-sec-3-3-5" class="outline-4">
<h4 id="sec-3-3-5"><span class="section-number-4">3.3.5</span> ipywidgets</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
The interactive HTML widgets allow to create interactive notebooks with sliders, dropdown menues or check-boxes
Installation is via
</p>
<div class="org-src-container">

<pre class="src src-bash">pip install ipywidgets
jupyter nbextension enable --py --sys-prefix widgetsnbextension
</pre>
</div>
<p>
possibly requiering a restart. 
</p>

<p>
Examples include
</p>
<dl class="org-dl">
<dt> ipyleaflet </dt><dd>a leaflet widget for interactive maps, <a href="https://github.com/ellisonbg/ipyleaflet">link</a> 
</dd>
<dt> bqplot </dt><dd>for interactive plotting, <a href="https://github.com/bloomberg/bqplot">link</a>
</dd>
<dt> nature demo </dt><dd>running interactive plot on private Jupyter server, <a href="http://www.nature.com/news/ipython-interactive-demo-7.21492">link</a>
</dd>
</dl>
</div>
</div>
</div>
