tutorials/org/topoigit.org
** Python-Packages

Useful or required Python packages. If several Python version are available on the system, the command pip might point to Python 2. Therefore, use pip3 for installing packages 
available for the Python3 kernel.

+ pandas :: ~pip install pandas~, the standard for data science, [[http://pandas.pydata.org/][link]]
+ numpy :: ~pip install numpy~, for math and numerics, usefull for large datasets, [[www.numpy.org][link]]
+ beatifulsoup :: ~pip install beautifulsoup4~, for getting data from websites, [[https://www.crummy.com/software/BeautifulSoup/][link]]
+ matplotlib :: ~pip install matplotlib~, plotting 2D graphs of all sorts, [[http://matplotlib.org/][link]]
+ bokeh :: ~pip install bokeh~, interactive plotting with zooming, panning, etc, [[http://bokeh.pydata.org/en/latest/][link]]
+ folium :: ~pip install folium~, interactive plotting on maps, using leaflet, [[https://github.com/python-visualization/folium][link]]

** Usage

*** Import Notebook file

<<ImportNotebook>>
Using the above extension jupyter_cms allows to import notebooks as one would do with modules. 

First, create a notebook that contains, optionally, a markdown cell explaining the init procedure, a code cell wit ~# <help>~, and a code cell containing the basic lines of code which should always be evaluated marked by ~# <api>~
#+BEGIN_SRC markdown
## Basic assembly of dataframe

Imports all helper functions and creates a full dataframe "df" with all information concerning manuscripts contained in the JSON file. In addition a new column is added, which contains a transformed numerical date, which gives the century with which a manuscript is dated.
#+END_SRC

#+BEGIN_SRC python
 # <help>
#+END_SRC

#+BEGIN_SRC python
#  <api>
from medDiaJson import *
from roman_date import *

print('Creating dataframe with all Medieval Diagram Information... Stay tuned!')
df = medDiaCon(237)
print('Creation finished. Variable is stored as "df"')
df['date_trf'] = df['date'].apply(lambda row: from_roman(row)*100)
#+END_SRC

Save all three cells in a Jupyter notebook. If the name of the notebook is Init_Dataframe.ipynb, it can be loaded into another notebook by running

#+BEGIN_SRC python
%load_ext jupyter_cms
medDia = load_notebook('./Init_Dataframe.ipynb')
medDia.help()
#+END_SRC

This will first import the helper functions, then print the message on creating a dataframe. Once this creation is finished, the next print command is executed and the new dataframe df is extended by applying a the transformation of roman numerals to centuries. All functions and the dataframe itself are then accesible by ~medDia.NAME~. The help call will print the markdown cell of the loaded notebook.

More usage scenarios are explained [[https://github.com/jupyter-incubator/contentmanagement/blob/master/etc/notebooks/cookbooks_demo/use_cookbooks.ipynb][here]].

* Helper functions

This section describes available helper functions for the different projects.

** Medieval Diagrams

Several useful helper functions are available in the medDiaJson.py module. This subsection gives a short explanation of each function. 
The module file is assumed to be in the same folder as the Jupyter notebook. Another option is importing a initialization notebook. This 
is explained in the [[ImportNotebook][Section]] on Jupyter.

Using the following in a Jupyter notebook will import all helper functions by their name. 
#+BEGIN_SRC python
from medDiaJson import *
#+END_SRC

Alternatively, one can import the module and provide a name
#+BEGIN_SRC python
import medDiaJson as medDia
#+END_SRC
All functions are now available as medDia.NAME. A further advantage of this is, that executing 
#+BEGIN_SRC python
medDia.TAB
#+END_SRC
where TAB is the TAB key, will give a list of all possible functions and variables. Moreover, running one of the two 
#+BEGIN_SRC python
 medDia.NAME?
 NAME?
#+END_SRC
will display the docstring documentation of each helper function.

*** Presentation

+ id2image(dataframe,diaID) :: calls digilib link to image in current tab

+ textId2imagegrid(dataframe, author, textID) ::  displays all diagrams for given textID as a grid in current tab

+ manID2image(dataframe, manID) :: opens new tab linking to the edition-topoi collection corresponding to the manuscript ID

+ altId2image(dataframe, diaID) :: as above but for diagram ID

*** Dataframe Preparation

+ level0 - level4 ::  helper functions for flattening JSON file for medieval diagram at various levels

+ diagCon(manuscr, text, page, diagram) :: uses the flattening functions to generate full dataframe for given diagram

+ rangePages, rangeDiag,rangeTexts,rangeMan :: helper functions for getting length of different lists

+ biblioCon(manuscr) :: uses all the above functions to generate full dataframe for given manuscript ID, which contains all diagrams of that manuscript

+  medDiaCon(x) :: uses biblioCon to generate full dataframe for the first x entries in the JSON file

*** Modification

+ uniqueValues(dataframe, key) :: lists all possible values for given key  in the dataframe, e.g., all different authors

+ authorKey(dataframe, author, key) :: as above, but gives values belonging to author

+ diagYearAuthor(dataframe, author) :: returns dataframe with diagram ID and date for given author

+ diaID2Type(dataframe, diaID) :: returns diaType for given diaID

+ diaTypeDescr(dataframe,diaType) :: returns description for diagram type, as saved in JSON file

+ reducedData(dataframe, keyValueList,debug=False) :: reduces full dataframe to those rows and columns, that full fill the keyValueList (boolean selection), e.g. reducedData(df,[['author','Capella'],['diaTyp', 20.0]]) returns dataframe for diagrams of type 20 and author Capella

+ diaAttrPlot(dataframe, author, diaTyp) :: prepares dataframe for plotting occurance of diagram attributes for given author and diagram type. Attributes are summed and sorted by date. Can be used in Bokeh plot. 
     
* Tasks
** TODO Add python visualization examples
** TODO Extend Jupyter usage
   
