tutorials/org/topoigit.html


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Python-Packages</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Useful or required Python packages. If several Python version are available on the system, the command pip might point to Python 2. Therefore, use pip3 for installing packages 
available for the Python3 kernel.
</p>

<dl class="org-dl">
<dt> pandas </dt><dd><code>pip install pandas</code>, the standard for data science, <a href="http://pandas.pydata.org/">link</a>
</dd>
<dt> numpy </dt><dd><code>pip install numpy</code>, for math and numerics, usefull for large datasets, <i>link</i>
</dd>
<dt> beatifulsoup </dt><dd><code>pip install beautifulsoup4</code>, for getting data from websites, <a href="https://www.crummy.com/software/BeautifulSoup/">link</a>
</dd>
<dt> matplotlib </dt><dd><code>pip install matplotlib</code>, plotting 2D graphs of all sorts, <a href="http://matplotlib.org/">link</a>
</dd>
<dt> bokeh </dt><dd><code>pip install bokeh</code>, interactive plotting with zooming, panning, etc, <a href="http://bokeh.pydata.org/en/latest/">link</a>
</dd>
<dt> folium </dt><dd><code>pip install folium</code>, interactive plotting on maps, using leaflet, <a href="https://github.com/python-visualization/folium">link</a>
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Usage</h3>
<div class="outline-text-3" id="text-3-5">
</div><div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Import Notebook file</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
<a id="ImportNotebook" name="ImportNotebook"></a>
Using the above extension jupyter_cms allows to import notebooks as one would do with modules. 
</p>

<p>
First, create a notebook that contains, optionally, a markdown cell explaining the init procedure, a code cell wit <code># &lt;help&gt;</code>, and a code cell containing the basic lines of code which should always be evaluated marked by <code># &lt;api&gt;</code>
</p>
<div class="org-src-container">

<pre class="src src-markdown">## Basic assembly of dataframe

Imports all helper functions and creates a full dataframe "df" with all information concerning manuscripts contained in the JSON file. In addition a new column is added, which contains a transformed numerical date, which gives the century with which a manuscript is dated.
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python"># &lt;help&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">#  &lt;api&gt;
from medDiaJson import *
from roman_date import *

print('Creating dataframe with all Medieval Diagram Information... Stay tuned!')
df = medDiaCon(237)
print('Creation finished. Variable is stored as "df"')
df['date_trf'] = df['date'].apply(lambda row: from_roman(row)*100)
</pre>
</div>

<p>
Save all three cells in a Jupyter notebook. If the name of the notebook is Init_Dataframe.ipynb, it can be loaded into another notebook by running
</p>

<div class="org-src-container">

<pre class="src src-python">%load_ext jupyter_cms
medDia = load_notebook('./Init_Dataframe.ipynb')
medDia.help()
</pre>
</div>

<p>
This will first import the helper functions, then print the message on creating a dataframe. Once this creation is finished, the next print command is executed and the new dataframe df is extended by applying a the transformation of roman numerals to centuries. All functions and the dataframe itself are then accesible by <code>medDia.NAME</code>. The help call will print the markdown cell of the loaded notebook.
</p>

<p>
More usage scenarios are explained <a href="https://github.com/jupyter-incubator/contentmanagement/blob/master/etc/notebooks/cookbooks_demo/use_cookbooks.ipynb">here</a>.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Helper functions</h2>
<div class="outline-text-2" id="text-4">
<p>
This section describes available helper functions for the different projects.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Medieval Diagrams</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Several useful helper functions are available in the medDiaJson.py module. This subsection gives a short explanation of each function. 
The module file is assumed to be in the same folder as the Jupyter notebook. Another option is importing a initialization notebook. This 
is explained in the <a href="#ImportNotebook">Section</a> on Jupyter.
</p>

<p>
Using the following in a Jupyter notebook will import all helper functions by their name. 
</p>
<div class="org-src-container">

<pre class="src src-python">from medDiaJson import *
</pre>
</div>

<p>
Alternatively, one can import the module and provide a name
</p>
<div class="org-src-container">

<pre class="src src-python">import medDiaJson as medDia
</pre>
</div>
<p>
All functions are now available as medDia.NAME. A further advantage of this is, that executing 
</p>
<div class="org-src-container">

<pre class="src src-python">medDia.TAB
</pre>
</div>
<p>
where TAB is the TAB key, will give a list of all possible functions and variables. Moreover, running one of the two 
</p>
<div class="org-src-container">

<pre class="src src-python">medDia.NAME?
NAME?
</pre>
</div>
<p>
will display the docstring documentation of each helper function.
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Presentation</h4>
<div class="outline-text-4" id="text-4-1-1">
<dl class="org-dl">
<dt> id2image(dataframe,diaID) </dt><dd>calls digilib link to image in current tab
</dd>

<dt> textId2imagegrid(dataframe, author, textID) </dt><dd>displays all diagrams for given textID as a grid in current tab
</dd>

<dt> manID2image(dataframe, manID) </dt><dd>opens new tab linking to the edition-topoi collection corresponding to the manuscript ID
</dd>

<dt> altId2image(dataframe, diaID) </dt><dd>as above but for diagram ID
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Dataframe Preparation</h4>
<div class="outline-text-4" id="text-4-1-2">
<dl class="org-dl">
<dt> level0 - level4 </dt><dd>helper functions for flattening JSON file for medieval diagram at various levels
</dd>

<dt> diagCon(manuscr, text, page, diagram) </dt><dd>uses the flattening functions to generate full dataframe for given diagram
</dd>

<dt> rangePages, rangeDiag,rangeTexts,rangeMan </dt><dd>helper functions for getting length of different lists
</dd>

<dt> biblioCon(manuscr) </dt><dd>uses all the above functions to generate full dataframe for given manuscript ID, which contains all diagrams of that manuscript
</dd>

<dt> medDiaCon(x) </dt><dd>uses biblioCon to generate full dataframe for the first x entries in the JSON file
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Modification</h4>
<div class="outline-text-4" id="text-4-1-3">
<dl class="org-dl">
<dt> uniqueValues(dataframe, key) </dt><dd>lists all possible values for given key  in the dataframe, e.g., all different authors
</dd>

<dt> authorKey(dataframe, author, key) </dt><dd>as above, but gives values belonging to author
</dd>

<dt> diagYearAuthor(dataframe, author) </dt><dd>returns dataframe with diagram ID and date for given author
</dd>

<dt> diaID2Type(dataframe, diaID) </dt><dd>returns diaType for given diaID
</dd>

<dt> diaTypeDescr(dataframe,diaType) </dt><dd>returns description for diagram type, as saved in JSON file
</dd>

<dt> reducedData(dataframe, keyValueList,debug=False) </dt><dd>reduces full dataframe to those rows and columns, that full fill the keyValueList (boolean selection), e.g. reducedData(df,[['author','Capella'],['diaTyp', 20.0]]) returns dataframe for diagrams of type 20 and author Capella
</dd>

<dt> diaAttrPlot(dataframe, author, diaTyp) </dt><dd>prepares dataframe for plotting occurance of diagram attributes for given author and diagram type. Attributes are summed and sorted by date. Can be used in Bokeh plot. 
</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Tasks</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Add python visualization examples</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Extend Jupyter usage</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: August/2016</p>
<p class="author">Author: Malte Vogl</p>
<p class="date">Created: 2016-08-25 Do 16:30</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
